Autodesk.Revit.DB.ViewSchedule.SetStripedRowsColor(Autodesk.Revit.DB.StripedRowPattern,Autodesk.Revit.DB.Color)
Sets the color applied to part of the pattern for a schedule with striped rows.
index:
The part of the striped row pattern.
color:
The color which will be used in striped row pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2021